app/views/recipes/show.html.erb

            </tr>
<% @recipes.steps.each do |step| %>
---
SELECT "steps".* FROM "steps" WHERE ("steps".recipe_id = 1)

                <ul class="unstyled">
                <% @step.step_ingredients.each do |step_ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE ("ingredients".step_id = 1)