app/controllers/recipes_controller.rb

        puts "measurment #{measurment}"
        puts "quantity #{mquantity}"

        id = Ingredient.find_or_create_by_name(names[iindex]).id
        ing = StepIngredient.new(:quanity => mquantity, :measurement => measurment, :ingredient_id => id)
        mStep.step_ingredients << ing
      end
      mStep.save!

      @recipe.steps << mStep
---
INSERT INTO "ingredients" ("name", "step_id", "created_at", "updated_at") VALUES ('mushrooms', 1, '2011-11-13 00:35:28.376686', '2011-11-13 00:35:28.376686')
INSERT INTO "steps" ("description", "recipe_id", "seq", "created_at", "updated_at") VALUES ('Mix chicken with mushrooms', 1, NULL, '2011-11-13 00:35:28.370698', '2011-11-13 00:35:28.370698')
INSERT INTO "recipes" ("name", "timetocook", "servings", "votes_up", "votes_down", "created_at", "updated_at", "preperationtime", "description") VALUES ('Chicken Marsala', 100, 10, NULL, NULL, '2011-11-13 00:35:28.300241', '2011-11-13 00:35:28.300241', NULL, 'OM NOM NOM')